#include<bits/stdc++.h>//万能头文件 
using namespace std;//输入输出的命名空间

//函数：返回值类型 函数名(形参列表){ 函数体 }
//形参列表=(参数数据类型 参数名)*
//()*表示()里的内容可能0个，可能多个 
int main(){//main函数是程序的入口 
	//定义数据 数据类型 数据名
	//多个数据用','间隔 
	//每行语句以';'结尾 
	int x=10,y=20;
	cout<<x<<" "<<y;
	
	//short 短整数,int 整数,long 长整数
	//float 单精度浮点数，double 双精度浮点数
	//bool 布尔
	//char 字符
	//基础数据类型就这7种
	//由于程序设计的数据较大
	//long long更大的整数
	//long double 精度更大的浮点数 
	//这两种也是较为常见的
	int array[10]={1,2,3,4,5,6,7,8,9,10};
	//[] 数组类型,这个例子是存放整数的数组 
	//结构体struct，共用体union，枚举menu，指针*(&)，空类型void 
	//这五类后面会讲到 
	return 0;//因为main函数的返回值类型为int，故要返回整数 
} 
